In [50]:
import numpy as np 
import pandas as pd

In [51]:
df1 = pd.DataFrame() 
df2 = pd.DataFrame()

In [52]:
df1['viewers'] = ["Sushmita", "Adam", "Benny", "Anurag"]
df2['users'] = ["Adam", "Anurag", "Benny", "Sushmita", "Apoorva"]

In [53]:
np.random.seed(1729)
df1 = df1.assign(views = np.random.normal(100, 100, 4)) 
df2 = df2.assign(cost = [20, np.nan, 15, 2, 7])

In [54]:
df1.head()

    viewers       views
0  Sushmita   31.266056
1      Adam   17.900529
2     Benny  265.236086
3    Anurag   42.470696

In [55]:
df2.head()

      users  cost
0      Adam  20.0
1    Anurag   NaN
2     Benny  15.0
3  Sushmita   2.0
4   Apoorva   7.0

In [56]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left") 
df.head()

    viewers       views     users  cost
0  Sushmita   31.266056  Sushmita   2.0
1      Adam   17.900529      Adam  20.0
2     Benny  265.236086     Benny  15.0
3    Anurag   42.470696    Anurag   NaN

In [57]:
df=df.fillna(df.mean())

In [58]:
df['Gender'] = ["Female", "Male", "Male", "Female"]

In [59]:
df

    viewers       views     users       cost  Gender
0  Sushmita   31.266056  Sushmita   2.000000  Female
1      Adam   17.900529      Adam  20.000000    Male
2     Benny  265.236086     Benny  15.000000    Male
3    Anurag   42.470696    Anurag  12.333333  Female

In [60]:
df['Gender']=df['Gender'].map({"Female":"F","Male":"M"})

In [61]:
df

    viewers       views     users       cost Gender
0  Sushmita   31.266056  Sushmita   2.000000      F
1      Adam   17.900529      Adam  20.000000      M
2     Benny  265.236086     Benny  15.000000      M
3    Anurag   42.470696    Anurag  12.333333      F

In [62]:
df[['views','cost']].apply(lambda x: round(x,2), axis=1)

    views   cost
0   31.27   2.00
1   17.90  20.00
2  265.24  15.00
3   42.47  12.33

In [63]:
df.groupby('Gender')['cost'].sum()

Gender
F    14.333333
M    35.000000
Name: cost, dtype: float64

In [64]:
df.set_index(['viewers'], inplace = True)

In [65]:
df.head()

               views     users       cost Gender
viewers
Sushmita   31.266056  Sushmita   2.000000      F
Adam       17.900529      Adam  20.000000      M
Benny     265.236086     Benny  15.000000      M
Anurag     42.470696    Anurag  12.333333      F

In [67]:
df.loc[['Adam','Anurag'],['cost','views']]

              cost      views
viewers
Adam     20.000000  17.900529
Anurag   12.333333  42.470696

In [44]:
df=pd.DataFrame({'Currency': pd.Series(['USD','EUR','GBP']),'ValueInINR': pd.Series([70, 89, 99])})

df.head()

  Currency  ValueInINR
0      USD          70
1      EUR          89
2      GBP          99

In [45]:
import copy
df1 = df.copy(deep=True)

In [46]:
df1.head()

  Currency  ValueInINR
0      USD          70
1      EUR          89
2      GBP          99

In [47]:
df.drop(['Currency'],axis=1)

   ValueInINR
0          70
1          89
2          99

In [48]:
pd.DataFrame.from_dict({'Currency': ['USD','EUR','GBP'],'ValueInINR':[70, 89, 99]})

  Currency  ValueInINR
0      USD          70
1      EUR          89
2      GBP          99